In [1]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [8]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e', 'd', 'e'])

In [9]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [12]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [14]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [15]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [19]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a','c','d'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [20]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [21]:
states = ['Texas', 'Utah', 'California']

In [22]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [25]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data.drop('Ohio', inplace=True)

In [33]:
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [37]:
obj['b']

1.0

In [38]:
obj[1:4]

b    1.0
c    2.0
d    3.0
dtype: float64

In [39]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [40]:
obj['b': 'c']

b    1.0
c    2.0
dtype: float64

In [41]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [42]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [43]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [44]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [48]:
data[data['three'] > 9]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [51]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [54]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [55]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [56]:
data.loc['Utah','two']

9

In [61]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [62]:
data.iloc[:, :3][data['three'] > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [64]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [65]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [66]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [67]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [68]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [70]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])

In [71]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [72]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [73]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [74]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [75]:
df1 = pd.DataFrame({'A': [1,2]})

In [76]:
df2 = pd.DataFrame({'B': [3,4]})

In [77]:
df1

   A
0  1
1  2

In [78]:
df2

   B
0  3
1  4

In [79]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [80]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [81]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns=list('abcd'))

In [82]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))

In [83]:
df2.loc[1, 'b'] = np.nan

In [84]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [85]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [86]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [87]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [88]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Orgeon'])

In [89]:
series = frame.iloc[0]

In [90]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [91]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Orgeon  9.0  9.0  9.0

In [92]:
series3 = frame['d']

In [93]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Orgeon    10.0
Name: d, dtype: float64

In [94]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Orgeon -1.0  0.0  1.0

In [95]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.354124  0.493676 -0.511290
Ohio   -0.981350 -2.377823  0.602310
Texas   0.303715  0.187134  1.570657
Oregon  0.425872 -0.639513  0.345201

In [96]:
f = lambda x: x.max() - x.min()

In [98]:
frame.apply(f)

b    1.407222
d    2.871499
e    2.081947
dtype: float64

In [99]:
frame.apply(f, axis='columns')

Utah      1.004966
Ohio      2.980133
Texas     1.383523
Oregon    1.065385
dtype: float64

In [100]:
format = lambda x: '%.2f' % x

In [101]:
frame.applymap(format)

            b      d      e
Utah    -0.35   0.49  -0.51
Ohio    -0.98  -2.38   0.60
Texas    0.30   0.19   1.57
Oregon   0.43  -0.64   0.35

In [102]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [103]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [105]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three', 'one'],
                    columns=['d','a','b','c'])

In [108]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [109]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [110]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [111]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [112]:
obj = pd.Series([4,7,-3,2])

In [113]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [114]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [115]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [117]:
frame = pd.DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})

In [118]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [119]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [120]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [121]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [122]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [123]:
obj = pd.Series(range(5), index=['a','a','b','b','c'])

In [124]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [125]:
obj.index.is_unique

False

In [126]:
obj['a']

a    0
a    1
dtype: int64

In [127]:
obj['c']

4

In [128]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])

In [129]:
df

          0         1         2
a  0.920171 -1.548045  0.114184
a -0.779081  0.777925 -1.898876
b -0.270309  1.715678  0.615242
b -1.390155  2.122589 -1.044774

In [130]:
df.loc['b']

          0         1         2
b -0.270309  1.715678  0.615242
b -1.390155  2.122589 -1.044774

In [131]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], 
                   [0.75, -1.3]],
                 index = ['a', 'b', 'c', 'd'],
                 columns=['one', 'two'])

In [132]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [133]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [134]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [136]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [138]:
df.idxmax()

one    b
two    d
dtype: object

In [139]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [140]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [141]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'a', 'b', 'b', 'c', 'c'])

In [142]:
obj

0    c
1    a
2    d
3    a
4    a
5    a
6    b
7    b
8    c
9    c
dtype: object

In [143]:
uniques = obj.unique()

In [144]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [145]:
obj.value_counts()

a    4
c    3
b    2
d    1
dtype: int64

In [146]:
obj

0    c
1    a
2    d
3    a
4    a
5    a
6    b
7    b
8    c
9    c
dtype: object

In [148]:
mask = obj.isin(['b', 'c'])

In [149]:
mask

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8     True
9     True
dtype: bool

In [150]:
obj[mask]

0    c
6    b
7    b
8    c
9    c
dtype: object